[
  {
    "title": "Mira and the Missing Lunchbox",
    "overview": "Mira learns empathy when her missing lunchbox leads to a surprising discovery.",
    "detailed_story": "<div style=\"background-color:#FFF8DC; border: 2px solid #F4A261; border-radius: 12px; padding: 20px; max-width: 600px; font-family: 'Comic Sans MS', cursive; color: #333;\"><h2 style=\"color:#E76F51; text-align:center;\">Mira and the Missing Lunchbox</h2><p>It was a bright Tuesday morning, and <strong style=\"color:#2A9D8F;\">Mira</strong> was excited to eat her favorite <em>paneer paratha</em> at lunch. But when she opened her bag — her lunchbox was <span style=\"color:#E63946; font-weight:bold;\">missing!</span></p><p>Her face dropped. Tears welled up. As she looked around, she noticed <strong style=\"color:#2A9D8F;\">Rehan</strong> sitting in the corner, nibbling at something that looked like... her paratha!</p><p style=\"background-color:#FAD2E1; padding:10px; border-radius:8px;\">Anger rose in Mira’s heart. But instead of yelling, she walked up and said gently, <em>“Rehan, is that my lunch?”</em></p><p>Rehan looked scared. He nodded and muttered, <em>“I’m sorry… I didn’t eat dinner last night. I was so hungry.”</em></p><p>Mira was surprised. She didn’t expect that answer. She took a deep breath and sat next to him. <strong>“Next time, just tell me. We can share.”</strong></p><p style=\"background-color:#D8F3DC; padding:10px; border-left:5px solid #40916C; border-radius:4px;\"><strong>Moral:</strong> From that day, Mira and Rehan became friends — and she learned that sometimes, <strong style=\"color:#1D3557;\">understanding someone’s pain is more important than reacting in anger</strong>.</p></div>"
  },
  {
    "title": "The Muddy Shoes",
    "overview": "Aryan discovers why his classmate stepped into class with dirty shoes.",
    "detailed_story": "<div style=\"background-color:#E0F7FA; border: 2px solid #00796B; border-radius: 12px; padding: 20px; max-width: 600px; font-family: 'Comic Sans MS', cursive; color: #004D40;\"><h2 style=\"color:#00796B; text-align:center;\">The Muddy Shoes</h2><p>Everyone stared at <strong>Ajay</strong>'s muddy shoes as he walked into class. The floor got dirty, and <strong>Aryan</strong> immediately whispered, <em>“Why can’t he just be clean?”</em></p><p>During break, Aryan saw Ajay outside cleaning his shoes near the tap. Curious, he asked, <em>“Why didn’t you clean them earlier?”</em></p><p><strong>Ajay</strong> looked up and said, <em>“I live far away and walk through fields to come here. It rained this morning, and I had no other shoes.”</em></p><p style=\"background-color:#FFECB3; padding:10px; border-radius:8px;\">Aryan felt embarrassed. He offered his handkerchief to help and said, <strong>“Next time, let me help. You shouldn't feel bad for something you can’t control.”</strong></p><p style=\"background-color:#DCEDC8; padding:10px; border-left:5px solid #7CB342; border-radius:4px;\"><strong>Moral:</strong> <span style=\"color:#33691E;\">Empathy means walking a mile in someone else’s muddy shoes—sometimes literally!</span></p></div>"
  },
  {
    "title": "The Forgotten Birthday",
    "overview": "When no one remembers Fatima's birthday, a friend helps make her day special.",
    "detailed_story": "<div style=\"background-color:#FFF3E0; border: 2px solid #FB8C00; border-radius: 12px; padding: 20px; max-width: 600px; font-family: 'Comic Sans MS', cursive; color: #4E342E;\"><h2 style=\"color:#FB8C00; text-align:center;\">The Forgotten Birthday</h2><p><strong>Fatima</strong> quietly entered the class with a small badge pinned to her dress: <em>“It’s my Birthday!”</em></p><p>No one seemed to notice. No cards. No songs. She looked at her desk, hoping for a surprise. Nothing.</p><p><strong>Riya</strong>, who sat next to her, was busy reading but noticed Fatima’s sad eyes. She leaned over and asked, <em>“Is something wrong?”</em></p><p>Fatima whispered, <em>“It’s my birthday today.”</em></p><p style=\"background-color:#FFE0B2; padding:10px; border-radius:8px;\">Without missing a beat, Riya jumped up, clapped loudly and shouted, <strong>“Class! It’s Fatima’s birthday!”</strong> The class quickly joined in singing a song. Riya even drew a little card with hearts on it.</p><p>Fatima smiled wide — it turned into the best part of her day.</p><p style=\"background-color:#FFECB3; padding:10px; border-left:5px solid #F57C00; border-radius:4px;\"><strong>Moral:</strong> <span style=\"color:#E65100;\">Sometimes, noticing someone’s small signals can help turn sadness into joy.</span></p></div>"
  },
  {
    "title": "The Shy New Boy",
    "overview": "Zara steps up to include a quiet boy in group activities.",
    "detailed_story": "<div style=\"background-color:#F3E5F5; border: 2px solid #8E24AA; border-radius: 12px; padding: 20px; max-width: 600px; font-family: 'Comic Sans MS', cursive; color: #4A148C;\"><h2 style=\"color:#8E24AA; text-align:center;\">The Shy New Boy</h2><p><strong>Zara</strong> noticed the new boy, <strong>Vihaan</strong>, sitting alone during the art activity. While everyone else laughed and shared crayons, he just watched quietly.</p><p>“Why doesn’t he talk?” someone whispered. Zara didn’t like that. She picked up her sketchpad and went to sit beside him.</p><p style=\"background-color:#E1BEE7; padding:10px; border-radius:8px;\">“Do you want to draw together?” she asked. He nodded. Slowly, they started drawing superheroes.</p><p>By the end of the session, Vihaan was smiling, and even shared a joke with her. The next day, he sat with Zara again — and this time, he brought his own crayons.</p><p style=\"background-color:#D1C4E9; padding:10px; border-left:5px solid #6A1B9A; border-radius:4px;\"><strong>Moral:</strong> <span style=\"color:#4A148C;\">Being kind and inviting someone in can help them open up in ways we never imagine.</span></p></div>"
  }
]
