[
  {
    "idea": "Sharing a 'Feeling Face' Story",
    "purpose": "To gently introduce the concept of recognizing emotions in others. By sharing a simple story about a time they saw someone showing a particular emotion (happy, sad, surprised), they start thinking about outward expressions of feelings without directly focusing on empathy yet. This can make them comfortable sharing and listening.",
    "reflective_questions": [
      "Think about a time you saw someone look really happy. What do you think made them feel that way?",
      "Can you remember a time someone looked a little sad? What might have happened?",
      "Have you ever seen someone look surprised? What could have caused that surprise?"
    ]
  },
  {
    "idea": "The 'Invisible Backpack'",
    "purpose": "To introduce the idea that everyone carries unseen experiences and feelings. This helps lay the groundwork for understanding that others might be going through things we don't know about, which is a key aspect of empathy.",
    "reflective_questions": [
      "Imagine everyone here has an invisible backpack. What kind of things might someone carry in their backpack that we can't see?",
      "Could someone's backpack have happy things in it? What about sad things?",
      "Do you think everyone's backpack feels the same weight every day? Why or why not?"
    ]
  },
  {
    "idea": "'If You Were In Their Shoes' - Simple Scenarios",
    "purpose": "To begin the process of perspective-taking in a light and relatable way. These simple scenarios encourage them to imagine themselves in another person's situation and consider their potential feelings.",
    "reflective_questions": [
      "Imagine your friend accidentally tripped and dropped their ice cream. How might they be feeling?",
      "What if someone new joined your class and looked a little nervous? How might they be feeling?",
      "Think about a time someone wasn't chosen for a game. How might that have made them feel?"
    ]
  },
  {
    "idea": "A Quick 'Kindness Chain' Thought",
    "purpose": "To start connecting empathy with kind actions. By reflecting on receiving kindness, they can begin to understand the positive impact of considering others' feelings.",
    "reflective_questions": [
      "Think of a small act of kindness someone has shown you. How did that make you feel?",
      "Have you ever done something kind for someone else? How did it feel to do that?",
      "Why do you think it's important to be kind to others?"
    ]
  }
]
